In [1]:
import pandas as pd
people={"first":["Rajat","corey","John",None],
        "last":["Gupta","sch","doe","na"],
        "email":["RajatGupta@email.com","corey@email.com","john@email.com","Missing"]}
df=pd.DataFrame(people)

In [2]:
df

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    sch       corey@email.com
2   John    doe        john@email.com
3   None     na               Missing

In [3]:
df.to_excel("first_b.xlsx",sheet_name="first",index=False)

In [4]:
pd.read_excel("first_b.xlsx")

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    sch       corey@email.com
2   John    doe        john@email.com
3    NaN     na               Missing

In [5]:
pd.read_excel("first_b.xlsx",header=1)

   Rajat Gupta RajatGupta@email.com
0  corey   sch      corey@email.com
1   John   doe       john@email.com
2    NaN    na              Missing

In [6]:
pd.read_excel("first_b.xlsx",skiprows=1)

   Rajat Gupta RajatGupta@email.com
0  corey   sch      corey@email.com
1   John   doe       john@email.com
2    NaN    na              Missing

In [7]:
pd.read_excel("first_b.xlsx",na_values={"last":"na","email":"Missing"})

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    sch       corey@email.com
2   John    doe        john@email.com
3    NaN    NaN                   NaN

In [8]:
import numpy as np
def converter_first(cell):
    if cell=="corey":
        return "New"
    else:
        return cell
    
def converter_last(cell):
    if cell=="na":
        return "new2"
    else:
        return cell
    
pd.read_excel("first_b.xlsx",na_values={"last":"na","email":"Missing"},converters=
              {"first":converter_first,"last":converter_last})

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1    New    sch       corey@email.com
2   John    doe        john@email.com
3    NaN   new2                   NaN

In [9]:
pd.read_excel("first_b.xlsx",na_values={"last":"na","email":"Missing"},names=["first","last","email"],header=0)

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    sch       corey@email.com
2   John    doe        john@email.com
3    NaN    NaN                   NaN

In [10]:
df

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    sch       corey@email.com
2   John    doe        john@email.com
3   None     na               Missing

In [11]:
df.to_excel("second_b.xlsx",startrow=1,startcol=1,index=False,sheet_name="second")

In [12]:
pd.read_excel("second_b.xlsx")

   Unnamed: 0 Unnamed: 1 Unnamed: 2            Unnamed: 3
0         NaN      first       last                 email
1         NaN      Rajat      Gupta  RajatGupta@email.com
2         NaN      corey        sch       corey@email.com
3         NaN       John        doe        john@email.com
4         NaN        NaN         na               Missing

In [13]:
df.to_excel("third_b.xlsx",index=False,sheet_name="third",header=False)

In [14]:
pd.read_excel("third_b.xlsx")

   Rajat Gupta RajatGupta@email.com
0  corey   sch      corey@email.com
1   John   doe       john@email.com
2    NaN    na              Missing

In [15]:
df.to_excel("fourth_b.xlsx",columns=["first","last"],sheet_name="fourth",index=False)

In [16]:
pd.read_excel("fourth_b.xlsx")

   first   last
0  Rajat  Gupta
1  corey    sch
2   John    doe
3    NaN     na

In [17]:
with pd.ExcelWriter("Fifth_b.xlsx") as writer:
    df.to_excel(writer,sheet_name="fifth_i",columns=["first","last"],index=False)
    df.to_excel(writer,sheet_name="fifth_ii",index=False)

In [18]:
pd.read_excel("fifth_b.xlsx",sheet_name="fifth_i")

   first   last
0  Rajat  Gupta
1  corey    sch
2   John    doe
3    NaN     na

In [19]:
pd.read_excel("fifth_b.xlsx",sheet_name="fifth_ii")

   first   last                 email
0  Rajat  Gupta  RajatGupta@email.com
1  corey    sch       corey@email.com
2   John    doe        john@email.com
3    NaN     na               Missing